app/controllers/products_controller.rb

  def index
    @products = Product.order :name
---
SELECT `products`.* FROM `products` ORDER BY `products`.`name` ASC

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO `products` (`name`, `description`, `link`, `category_id`, `created_at`, `updated_at`) VALUES ('dsadsadsad', 'asdasdasdasdasdasdasdas', 'http://guides.rubyonrails.org/layouts_and_rendering.html', 1, '2016-10-24 01:22:13', '2016-10-24 01:22:13')