app/views/products/new.html.erb

SELECT `categories`.* FROM `categories`
---
        <label>Categoria</label>
        <%= f.collection_select(:category_id, Category.all, :id, :name, {:include_blank => "Selecione uma Categoria"}, {class: "form-control"}) %>